Repository: dfandrich/ssmtp
Catalog: debian/po/*.po
Languages: uk

source: Automatically overwrite config files?
uk: Автоматично перезаписувати файли налаштувань?

source: The mail configuration file /etc/ssmtp/ssmtp.conf can be automatically updated on each upgrade with the information supplied to the debconf database. If you do not want this to happen (ie/ you want to maintain control of this file yourself) then set this option to have the program never touch this file.
uk: Файл налаштувань пошти /etc/ssmtp/ssmtp.conf може автоматично оновлюватися під час встановлення нових версій програми на основі даних із бази даних debconf. Якщо ви не хочете цього робити (тобто хочете керувати вмістом цього файла власноруч), увімкніть цю можливість, щоб програма ніколи не чіпала файл налаштувань.

source: Username who gets mail for userids < 1000:
uk: Назва облікового запису користувача, який отримуватиме пошту для значень UID < 1000:

source: Mail sent to a local user whose UID is less than 1000 will instead be sent here. This is useful for daemons which mail reports to root and other system UIDs. Make this empty to disable rewriting.
uk: Пошта, яку надсилатимуть локальним користувачам, чиї UID матимуть значення менше за 1000, переспрямовуватиметься на вказаний обліковий запис. Це корисно для фонових служб, які надсилають звіти поштою адміністратору або UID системи. Не вказуйте ніяких значень, щоб вимкнути переспрямовування.

source: Name of your mailhub:
uk: Назва вашого поштового вузла:

source: This sets the host to which mail is delivered. The actual machine name is required; no MX records are consulted. Commonly, mailhosts are named "mail.domain.com".
uk: Цей параметр встановлює вузол, на який надсилатиметься пошта. Слід вказувати справжню назву вузла; записи MX не братимуться до уваги. Типово, вузли обробки пошти мають назву «mail.domain.com».

source: Remote SMTP port number:
uk: Номер віддаленого SMTP-порту:

source: If your remote SMTP server listens on a port other than 25 (Standard/RFC) then set it here.
uk: Якщо ваш віддалений сервер SMTP очікує на з'єднання на порту, відмінному від 25 (стандартного порту за RFC), вкажіть номер порту тут.

source: Domain to masquerade as:
uk: Домен для заміни:

source: ssmtp will use "username@REWRITEDOMAIN" as the default From: address for outgoing mail which contains only a local username.
uk: ssmtp використовуватиме адресу «користувач@ДОМЕН_ЗАМІНИ» як типову адресу для поля From: вихідної пошти. У цій адресі міститиметься лише локальна назва облікового запису користувуача.

source: Name to store in /etc/mailname:
uk: Назва, яка зберігатиметься у /etc/mailname:

source: This is the portion of the address after the '@' sign to be shown on outgoing news and mail messages.
uk: Це частина адреси після символу «@», яку буде показано у вихідних повідомленнях пошти і новин.

source: Fully qualified hostname:
uk: Повна доменна назва вузла:

source: This should specify the real hostname of this machine, and will be sent to the mailhub when delivering mail.
uk: Це значення має відповідати справжній назві вузла цього комп'ютера. Його буде надіслано до поштового вузла під час пересилання пошти.

source: Allow override of From: line in email header?
uk: Дозволити перевизначення рядка From: у заголовках повідомлень?

source: A "positive" response will permit local users to enter any From: line in their messages without it being mangled, and cause ssmtp to rewrite the envelope header with that address. A "negative" response will disallow this, and use only the default address or addresses set in /etc/ssmtp/revaliases.
uk: Позитивна відповідь дозволить локальним користувачам вказувати довільний рядок From: у повідомленнях без його виправлення і змусить ssmtp перезаписувати заголовок обгортки повідомлення з використанням вказаної адреси. Негативна відповідь заборонить такий перезапис — використовуватиметься лише типова адреса або адреси, вказані у файлів /etc/ssmtp/revaliases.
